# TitleSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TitleSize Property
ParameterTypeId Class See Also
---
"Size"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TitleSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TitleSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TitleSize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace